<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>ENI 2024</title>
    <link rel="stylesheet" href="./CSS/style.css">
    <link rel="icon" href="Ressource/Eni-logo.png">
</head>
<body>
    <header>
        <!-- Debut Barre de Navigation -->
        <nav>
            <input type="checkbox" id="checkbox">
            <label for="checkbox" class="checkbtn">
                <img src="Ressource/menu-hamburgeur.png" alt="menu-hamburgeur">
            </label>
            <ul>
                <li> <a href="#accueil" id="active">Accueil</a> </li>
                <li> <a href="#mission">Mission</a> </li>
                <li> <a href="#objectif">Objectif</a> </li>
                <li> <a href="#particularite">Particularite</a> </li>
                <li> <a href="#contact">Contact</a> </li>
            </ul>
        </nav>
        <!-- Fin Barre de Navigation -->
    </header>


    <!-- Corps du Site -->
    <main>
        <!-- Debut du Bloc partie-Accueil -->
        <div class="partie-accueil" id="accueil">
            <!-- Ici la conteneur du flexbox -->
            <div class="accueil-bloc-contenair">
                <!-- La Bloc1 sert a englober la partie gauche.-->
                <div class="bloc1">
                    <div class="logo">
                        <img src="Ressource/Eni-logo.png" alt="Logo-Eni">
                        <p id="logo-text">Ecole Nationale d'Informatique</p>
                    </div>
                    <p>Au d&eacute;but des ann&eacute;es 80,l'ENI de Madagascar &eacute;tait la premiere institution d'enseignement sup&eacute;rieur et de recherche renomm&eacute;e sp&eacute;cialis&eacute;e dans la formation en informatique.</p>
                    <p id="text-logo">En ce jour m&ecirc;me elle reste l'un des piliers du secteur informatique en Afrique. </p>
                    <a href="#mission">Suivre</a>
                </div>
                <!-- Fin de la Bloc1 -->
                <!-- Debut du bloc2 : La partie droite de l accueil -->
                <div class="bloc2">
                    <center><img src="Ressource/img-eni.jpg" alt="image-universite-ENI"></center>
                </div>
                <!-- Fin de la Bloc2 -->
            </div>
        </div>
        <!--Fin du Bloc partie-Accueil -->

        <!-- Debut du bloc-mission -->
        <p id="titre-mission">MISSION</p>
        <!-- Cette div sert a englober tous la partie-mission -->
        <div class="partie-mission" id="mission"> 
            <div class="mission-1">
                <div class="mission-1-text">
                    <p>Transmettre des connaissances: <br> Enseigner un corps de savoir etablie: Cela inclut les connaissances et les disciplines fondamentales de l'informatique. D&eacute;velopper la cr&eacute;ativit&eacute; des &eacute;l&egrave;ves &agrave; l'aide des outils num&eacute;riques et  les initier &aacute; parcourir le monde num&eacute;rique.</p>
                </div>
                <div class="mission-1-image">
                    <center><img src="Ressource/transmettre-connaissance.png" alt="Image vectorielle education"></center>
                </div>
            </div>
            <div class="mission-2">
                <div class="mission-2-text">
                    <p>D&eacute;velopper les comp&eacute;tences:<br> Au-dela des savoirs, L'ENI accro&icirc;t chez les &eacute;l&egrave;ves des comp&eacute;tences cl&eacute;s qui sont essentielles pour la r&eacute;ussite personnelle et professionnelle dans une entreprise ou societe en constante &eacute;volution .Ces comp&eacute;tences forcent les eleves &aacute; s'adapter a toutes les situations.</p>
                </div>
                <div class="mission-2-image">
                    <center><img src="Ressource/developpement-competence.png" alt="Caricature Developpement"></center>
                </div>
            </div>
            <div class="mission-3">
                <div class="mission-3-text">
                    <p>Inculquer des valeurs:<br> Etant une &eacute;cole et non une facult&eacute;, Elle nous apprend certaines valeurs notamment aider les &eacute;l&egrave;ves a devenir des Citoyens mod&egrave;les et responsables et le sens de la coop&eacute;ration entre &eacute;tudiants pour surmonter les probl&egrave;mes.</p>
                </div>
                <div class="mission-3-image">
                    <center><img src="Ressource/valeur-humain.png" alt="Caricature d un homme se demarquant"></center>
                </div>
            </div>
            <div class="mission-4">
                <div class="mission-4-text">
                    <p>Pr&eacute;aration des &eacute;l&egrave;ves &agrave; l' industrie:<br> Sensibiliser les &egrave;l&egrave;ves aux enjeux soci&eacute;taux li&eacute;s &agrave; l'Informatique et de leur montrer  son inportance in&eacute;branlable  dans la soci&eacute;t&eacute; actuelle.</p>
                </div>
                <div class="mission-4-image">
                    <center><img src="Ressource/preparation.png" alt="Preparation d un individu"></center>
                </div>
            </div>
        </div>
        <!-- Fin du Bloc-Mission -->

        <!-- Debut du Bloc-OBJECTIF -->
        <p id="titre-objectif">OBJECTIF</p>

        <!-- Cette div sert a englober tous la partie-objectif.-->
        <div class="partie-objectif" id="objectif">
            <div class="contenair-objectif-1">
                <div class="objectif-1">
                    <img src="Ressource/education-de-qualite.png" alt="Caricature representant une education de qualite">
                    <h3>Une Education de qualite:</h3>
                    <p>Offrir aux &eacute;l&egrave;ves une &eacute;ducation de qualit&eacute; et compl&egrave;te c'est &agrave; dire comprendre les principales bases de l'intelligence artificielle, de l'apprentissage automatique et du langage naturel et ma&icirc;triser les principes fondamentaux de l'informatique tels que les algorithmes, les structures de donn&eacute;es et les syst&egrave;mes d'exploitation.</p>
                </div>
            </div>
            <div class="contenair-objectif-2">
                <div class="objectif-2">
                    <img src="Ressource/cerveu-national.png" alt="un cerveu en diamant.">
                    <h3>Des sortants directement optionnels et actifs:</h3>
                    <p>Des &eacute;tudiants maitr&icirc;sants divers langages de programmation pour concevoir et d&eacute;velopper des logiciels complexes y compris des applications web,des applications mobiles et des syst&egrave;mes embarqu&eacute;s, les r&eacute;seaux et les bases de donn&eacute;es ; tels que le langage c, le c++, le java et le python voire d'autres encore qui seront directement actifs sur le march&eacute; du travail.</p>
                </div>
            </div>
            <div class="contenair-objectif-3">
                <div class="objectif-3">
                    <img src="Ressource/Perseverant.png" alt="Objectif atteint">
                    <h3>Professionalisme: </h3>
                    <p>Des ingenieurs et des licenci&eacute;s matures, acharn&eacute;s, pers&eacute;verants et comp&eacute;tants dans le secteur professionnel</p>
                    <p>former des informaticiens hautement qualifi&eacute;s capables de concevoir ,d&eacute;velopper et impl&eacute;menter des syst&egrave;mes informatiques plus complexes.</p>
                </div>
            </div>
            <div class="contenair-objectif-4">
                <div class="objectif-4">
                    <img src="Ressource/Leader-ship.png" alt="Un homme montant.">
                    <h3>Le Sens du Leadership:</h3>
                    <p>Savoir communiquer efficacement &agrave; l'oral et &aacute; l'&eacute;crit et &ecirc;tre capable de travailler et mener  Une &eacute;quipe et de mani&egrave;re autonome <br>Les former &agrave; devenir des entrepreneurs et des chefs d'entreprises dans le domaine des technologies de l'information et de la communication (TCI) et de trouver &agrave; nos &eacute;tudiants des d&eacute;bouch&eacute;s &aacute; l'&eacute;tranger.</p>
                </div>
            </div>
        </div>
        <!-- Fin du Bloc-objectif -->

        <!-- Debut du Bloc-particularite. -->
        <p id="titre-particularite">PARTICULARIT&Eacute;</p>
        <div class="partie-particularite" id="particularite">
            <div class="particularite-text">
                <p>De centre &agrave; fianarantsoa ,l'ENI dispose d'un d&eacute;partement dans le province de toliara jouissants  tous les deux les m&egrave;mes profits d'&eacute;ducation et possedant des infrastructures de haut de gamme respectant les normes internationales et des ressources mat&egrave;rielles n&eacute;c&eacute;ssaires pour le bon d&eacute;roulement de l'enseignement. <br>l'ENI prorpose des programmes de licence ,Master et Doctorat en informatique couvrant une large gamme de domaine informatique telles que la cybers&eacute;curit&eacute;, les r&eacute;s&eacute;aux ,l'intelligence artificielle et encore plein d'autres. <br>Les enseignants de l'ENI sont des experts reconnus dans leur domaine, issus du monde acad&eacute;mique et professionnel, pr&ecirc;ts &agrave; offrir une formation de qualit&eacute; aux &eacute;tudiants et &agrave; les pr&eacute;parer aux d&eacute;fis du march&eacute; du travail. <br>une institution reconnue internationalement pour de qualit&eacute; de ses formatiopns et ses collaborations avec des univers&icirc;t&ecirc;s et des entreprises &eacute;trang&egrave;res. <br>Les dipl&ocirc;m&eacute;s de l'ENI sont tr&egrave;s appr&eacute;ci&eacute;s des recruteurs et b&eacute;n&eacute;ficient d'un excellent taux d'insertion professionnelle.</p>
            </div>
            <div class="particularite-image">
                <img src="Ressource/particularite-eni.png" alt="Image d un logo au centre d un systeme informatique">
            </div>
        </div>
        <!-- Fin du Bloc-particularite. -->
    </main>
    <!--Fin corps du Site. -->

    <!-- Debut du footer -->
    <footer id="contact">
        <div class="contact-item1">
            <img src="Ressource/appel.png" alt="Logo appel">
            <p>+261 34 05 733 36</p>
        </div>
        <div class="contact-item2">
            <img src="Ressource/email.png" alt="Logo email">
            <p>eni@gmail.com</p>
        </div>
        <div class="contact-item3">
            <img src="Ressource/adress.png" alt="Logo adress">
            <p>BP 1487 Tanambao Fianarantsoa</p>
        </div>
        <div class="contact-item4">
            <a href="https://www.facebook.com/EcoleNationaleInformatiqueFianarantsoa" target="_blank"><img src="Ressource/facebook-logo-1-2.png" alt="Logo facebook"></a>
        </div>
    </footer>
    <!-- Fin du footer. -->
    <p id="copyright">&copy;Copyright 2024, All deserved</p>
</body>
</html>